# AddVertex Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexStreamPositionNormalColored..::..AddVertex Method
VertexStreamPositionNormalColored Class See Also
---
Inserts a VertexStreamPositionNormalColored into the stream and associated buffer.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void AddVertex(
	VertexPositionNormalColored vertex
)
```

Visual Basic
---
```text
Public Sub AddVertex ( _
	vertex As VertexPositionNormalColored _
)
```

Visual C++
---
```text
public:
void AddVertex(
	VertexPositionNormalColored^ vertex
)
```

# ### Parameters
vertex
    Type: Autodesk.Revit.DB.DirectContext3D..::..VertexPositionNormalColored The vertex to be inserted.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space. |

# See Also
VertexStreamPositionNormalColored Class
Autodesk.Revit.DB.DirectContext3D Namespace